Repository: MajedBannani/ArBricks
Catalog: languages/arbricks-*.po
Languages: ar

source: Math questions use random numbers (1-9) each time for better security
ar: تستخدم الأسئلة أرقاماً عشوائية (1-9) في كل مرة لمزيد من الأمان.

source: Medium (15%)
ar: متوسط (15%)

source: Message placeholder %s is automatically replaced with formatted amount (e.g., $50.00)
ar: سيتم استبدال %s تلقائياً بالمبلغ المنسق (مثال: 50.00 ر.س).

source: Message shown on validation failure
ar: الرسالة المعروضة عند فشل التحقق

source: Message shown to blocked bots
ar: الرسالة المعروضة للبوتات المحظورة

source: Milliseconds to wait before updating
ar: المللي ثانية للانتظار قبل التحديث

source: Minimum Amount
ar: الحد الأدنى للمبلغ

source: Minimum Amount: 50 (no currency symbol needed)
ar: الحد الأدنى للمبلغ: 50 (بدون رمز العملة).

source: Minimum Order Amount
ar: الحد الأدنى لقيمة الطلب

source: Minimum amount must be numeric - non-numeric values default to 50
ar: يجب أن يكون المبلغ رقمياً - القيم غير الرقمية ستعتبر 50 افتراضياً.

source: Minimum order value (numeric)
ar: قيمة الطلب الدنيا (رقمية)

source: More user-friendly than invisible honeypots or reCAPTCHA for non-technical users
ar: أسهل استخداماً من "الفخاخ المخفية" أو reCAPTCHA لبعض المستخدمين غير التقنيين.

source: Name of the honeypot field
ar: اسم حقل الفخ

source: No configuration needed - just use the shortcode
ar: لا يحتاج لإعدادات - فقط استخدم الكود المختصر.

source: No configuration needed - works automatically after enabling
ar: لا يحتاج لإعدادات - يعمل تلقائياً بمجرد التفعيل.

source: No external services used - completely local and privacy-friendly
ar: لا يتم استخدام خدمات خارجية - المعالجة محلية بالكامل وتحترم الخصوصية.

source: No further configuration needed - protection is automatic
ar: لا حاجة لمزيد من الإعدادات - الحماية تتم تلقائياً

source: Noscript Location
ar: موضع Noscript

source: Notes:
ar: ملاحظات:

source: Notice Type
ar: نوع الإشعار

source: Notice only appears when "blog_public" option is set to 0 (blocked)
ar: يظهر التنبيه فقط عندما يكون خيار "blog_public" مضبوطاً على 0.

source: Only Empty Fields (Safe)
ar: الحقول الفارغة فقط (آمن)

source: Only Empty Fields (recommended): Only fills in blank metadata, preserves your manual edits
ar: الحقول الفارغة فقط: يملأ المعلومات الناقصة فقط ويحافظ على تعديلاتك اليدوية.

source: Only activates when the cart total is 0.00 and no payment is required.
ar: يعمل فقط عندما يكون إجمالي السلة 0.00 ولا يتطلب الأمر دفع مبالغ.

source: Only affects frontend - admin bar still shows in WordPress admin area
ar: يؤثر على الواجهة الأمامية فقط - سيظل الشريط ظاهراً في لوحة التحكم.

source: Only affects images uploaded AFTER enabling - does not modify existing attachments
ar: يؤثر فقط على الصور المرفوعة بعد التفعيل - ولا يعدل المرفقات الحالية.

source: Only affects products with price exactly 0.00 (zero)
ar: يؤثر فقط على المنتجات ذات السعر 0.00 (صفر) تماماً.

source: Only protects wp-login.php - does not affect WooCommerce login forms or custom login pages
ar: تحمي صفحة wp-login.php فقط - لا تؤثر على نماذج دخول ووكومرس أو صفحات الدخول المخصصة

source: Optionally customize the block message shown to bots
ar: تخصيص رسالة الحظر المعروضة للبوتات اختيارياً

source: Optionally customize the error message and timeout
ar: يمكنك تخصيص رسالة الخطأ ومهلة الاتصال اختيارياً

source: Optionally customize the honeypot field name (advanced users only)
ar: تخصيص اسم حقل الفخ اختيارياً (للمستخدمين المتقدمين فقط)

source: Optionally enable "Block Direct Access" to return 403 error when xmlrpc.php is accessed
ar: يمكن تفعيل "حظر الوصول المباشر" لإرجاع خطأ 403 عند محاولة الوصول لملف xmlrpc.php.

source: Optionally enable "Empty Cart Before Adding" to ensure customers only buy one item at a time.
ar: يمكنك تفعيل "إفراغ السلة قبل الإضافة" لضمان شراء العميل لمنتج واحد فقط في كل مرة.

source: Original Capture: Replaces the original JPG/PNG file entirely to save disk space.
ar: استبدال الأصل: يستبدل ملف JPG/PNG بالكامل لتوفير مساحة القرص.

source: Output: Clickable mailto link with spam-protected email
ar: النتيجة: رابط بريد إلكتروني قابل للنقر ومحمي من السبام.

source: Part of a layered security approach - use with other security features
ar: جزء من نهج أمني متعدد الطبقات - يُنصح باستخدامه مع ميزات الأمان الأخرى.

source: Paste your Site Key and Secret Key into the fields below
ar: الصق مفتاح الموقع والمفتاح السري في الحقول أدناه

source: Performance: Slight increase in processing time during upload as conversion happens on-the-fly.
ar: الأداء: زيادة طفيفة في وقت المعالجة أثناء الرفع لأن التحويل يتم فورياً (On-the-fly).

source: Please complete the reCAPTCHA.
ar: يرجى إكمال reCAPTCHA.

source: Please enter CSS to minify.
ar: الرجاء إدخال CSS للتصغير.

source: Please enter a valid URL.
ar: الرجاء إدخال رابط صحيح.

source: Please enter a valid YouTube URL.
ar: الرجاء إدخال رابط YouTube صحيح.

source: Please enter a valid timestamp (e.g., 2:30 or 01:30:45).
ar: الرجاء إدخال طابع زمني صحيح (مثال: 2:30 أو 01:30:45).

source: Please select images to convert.
ar: الرجاء تحديد الصور للتحويل.

source: Please verify you are not a robot.
ar: يرجى التحقق من أنك لست روبوت.

source: Preserve Case
ar: الحفاظ على الأحرف

source: Preserve Case (recommended for Arabic): Keeps original filename case, important for non-Latin text
ar: الحفاظ على الأحرف: يحافظ على حالة أحرف الملف الأصلي، مهم للنصوص غير اللاتينية.

source: Prevents common mistake of launching sites with SEO blocked
ar: يمنع الخطأ الشائع بإطلاق المواقع بمحركات بحث محظورة.

source: Prevents customers from completing checkout if their cart total is below a specified minimum amount. Useful for covering shipping costs, ensuring profitability, or encouraging bulk purchases.
ar: يمنع العملاء من إتمام الطلب إذا كانت قيمة السلة أقل من الحد الأدنى المحدد. مفيد لتغطية تكاليف الشحن، أو ضمان الربحية، أو تشجيع الشراء بكميات كبيرة.

source: Provides [email] shortcode for spam-protected mailto links.
ar: يوفر كود [email] المختصر لروابط بريد محمية من السبام.

source: Provides a simple [email] shortcode to create clickable email links (mailto links) with built-in spam protection. WordPress's antispambot function encodes the email address to make it harder for spam bots to harvest.
ar: يوفر كوداً مختصراً بسيطاً [email] لإنشاء روابط بريد قابلة للنقر محمية من السبام. تقوم دالة antispambot الخاصة بووردبريس بترميز البريد لجعل جمعه صعباً على البوتات.

source: QR Code Generator Tool
ar: أداة إنشاء رمز QR

source: QR code generated!
ar: تم إنشاء رمز QR!

source: Quality: Converted at 85% quality by default (optimal balance between size and quality).
ar: الجودة: يتم التحويل بجودة 85% افتراضياً (توازن مثالي بين الحجم والجودة).

source: Quartile (25%)
ar: ربعي (25%)

source: Question text currently in Arabic - works for Arabic-language sites
ar: نص السؤال محدد باللغة العربية حالياً - مناسب للمواقع العربية.

source: Redirect to Checkout
ar: إعادة التوجيه للدفع

source: Redirect to checkout and skip cart for single items.
ar: الانتقال للدفع مباشرة وتخطي السلة للعناصر الفردية.

source: Reduce checkout fields when cart is free (no payment required).
ar: تقليل حقول الدفع عندما تكون السلة مجانية.

source: Remove "Order Again" button from orders
ar: إزالة زر «اطلب مرة أخرى» من الطلبات.

source: Remove WP Version
ar: إزالة إصدار ووردبريس

source: Remove WordPress version from head and feeds for security.
ar: إزالة إصدار ووردبريس من head والخلاصات للأمان.

source: Remove unnecessary default tags from wp_head (discovery links, shortlink, and optional REST/feed links).
ar: إزالة الأكواد الافتراضية غير الضرورية من رأس الصفحة (روابط الاكتشاف، الروابط المختصرة، وروابط خلاصات REST).

source: Removes <meta name="generator"> tag from HTML head
ar: يزيل وسم <meta name="generator"> من رأس HTML.

source: Removes Comments link from admin bar
ar: يزيل رابط التعليقات من شريط الأدوات العلوي.

source: Removes Comments menu from admin and redirects direct access to dashboard
ar: يزيل قائمة التعليقات من لوحة التحكم ويعيد توجيه الوصول المباشر إليها إلى الرئيسية.

source: Removes REST API comment endpoints for security
ar: يزيل نقاط نهاية واجهة REST API للتعليقات لأغراض أمنية.

source: Removes WordPress version number from HTML head and RSS feeds. Prevents potential attackers from easily identifying your WordPress version and targeting known vulnerabilities in that specific version.
ar: يزيل رقم إصدار ووردبريس من رأس HTML وخلاصات RSS. يمنع المهاجمين المحتملين من التعرف بسهولة على إصدار موقعك واستهداف الثغرات المعروفة فيه.

source: Removes unnecessary meta tags and links from the HTML <head> section. Cleans up wp_head() output by removing RSD link, Windows Live Writer manifest, and shortlink tags. Results in cleaner HTML and slightly improved performance.
ar: يزيل وسوم الميتا والروابط غير الضرورية من وسم <head> في كود HTML. ينظف مخرجات wp_head() بإزالة روابط RSD، وتقارير Windows Live Writer، والروابط المختصرة. والنتيجة هي كود HTML أنظف وتحسن طفيف في الأداء.

source: Removes version from RSS/Atom feeds
ar: يزيل رقم الإصدار من خلاصات RSS/Atom.

source: Replace hyphens/underscores with spaces
ar: استبدال الشرطات والشرطات السفلية بمسافات

source: Replaces the default price display with custom text (e.g., "Free!", "No Charge", "مجاني") for WooCommerce products that have a price of zero. Perfect for giveaways, free samples, or promotional items.
ar: يستبدل السعر الافتراضي بنص مخصص (مثل: "مجاني!" أو "بدون تكلفة") لمنتجات ووكومرس ذات السعر صفر. مثالي للهدايا أو العينات المجانية للترويج.

source: Requires GD or ImageMagick PHP extension with WebP support enabled on your server.
ar: يتطلب توافر إضافة GD أو ImageMagick في لغة PHP بموقعك مع تفعيل دعم WebP.

source: Requires WooCommerce plugin - feature does nothing if WooCommerce is not active
ar: تتطلب إضافة ووكومرس - الميزة لا تعمل إذا كان ووكومرس غير مفعل.

source: Requires valid API keys - invalid or missing keys will block ALL logins including administrators
ar: تتطلب مفاتيح API صالحة - المفاتيح الخاطئة أو المفقودة ستحظر جميع محاولات الدخول بما في ذلك المسؤولين

source: Return 403 when xmlrpc.php is accessed directly.
ar: إرجاع 403 عند الوصول المباشر لـ xmlrpc.php.

source: SEO
ar: تحسين محركات البحث

source: SEO Visibility Warning
ar: تحذير ظهور SEO

source: SEO Warning:
ar: تحذير SEO:

source: Safe for all sites - does not affect functionality
ar: آمن لجميع المواقع - لا يؤثر على وظائف الموقع.

source: Save Changes
ar: حفظ التغييرات

source: Scope: Only affects NEW uploads. Existing images in your media library are not processed.
ar: النطاق: يؤثر فقط على الرفوعات الجديدة. الصور الموجودة مسبقاً في مكتبة الوسائط لن يتم معالجتها.

source: Search engines are currently discouraged from indexing this site.
ar: محركات البحث محظورة حالياً من فهرسة هذا الموقع.

source: Secret Key
ar: المفتاح السري

source: Secret Key format: 6LcExampleSecret456XYZabc...
ar: صيغة المفتاح السري: 6LcExampleSecret456XYZabc...

source: Security
ar: الأمان

source: Security check failed. Please try again.
ar: حصل خطأ في التحقق الأمني. حاول مجددًا.

source: Security through obscurity - not a complete security solution
ar: الأمان عبر الإخفاء - ليس حلاً أمنياً كاملاً ولكنه خطوة إضافية.

source: Select "reCAPTCHA v2" and choose "I'm not a robot Checkbox"
ar: اختر "reCAPTCHA v2" ثم اختر "مربع اختيار أنا لست روبوت"

source: Select Images
ar: تحديد الصور

source: Select noscript position (body or footer).
ar: حدد موضع noscript (body أو footer).

source: Select notice type: Error (red) or Warning (yellow)
ar: اختر نوع التنبيه: خطأ (أحمر) أو تحذير (أصفر).

source: Select which fields to auto-generate: Title, Caption, Description, Alt Text
ar: حدد الحقول المراد توليدها: العنوان، التسمية، الوصف، النص البديل.

source: Set Alt Text
ar: تعيين النص البديل

source: Set Caption
ar: تعيين التسمية

source: Set Description
ar: تعيين الوصف

source: Set Title
ar: تعيين العنوان

source: Set any product price to 0 to see your custom label
ar: عيّن سعر أي منتج إلى 0 لترى التسمية المخصصة.

source: Set the "Debounce Delay" (default 250ms) to control how long to wait after the last quantity change before updating.
ar: حدد "تأخير منع التكرار" (الافتراضي 250ms) للتحكم في مدة الانتظار بعد آخر تغيير للكمية قبل التحديث.

source: Set your Minimum Amount (e.g., 50 for currency units)
ar: حدد الحد الأدنى للمبلغ (مثال: 50 بعملة المتجر).

source: Settings saved successfully!
ar: تم حفظ الإعدادات بنجاح!

source: Shortcode copied!
ar: تم نسخ الكود المختصر!

source: Show On
ar: عرض على

source: Show admin notice if search engines are blocked.
ar: عرض إشعار إداري إذا كانت محركات البحث محظورة.

source: Simplifies the checkout process for free products by removing unnecessary billing fields (like address, phone, and company) when the cart total is zero. Reduces friction and increases conversions for free downloads or signups.
ar: يبسط عملية الدفع للمنتجات المجانية عبر إزالة حقول الفوترة غير الضرورية (مثل العنوان، الهاتف، والشركة) عندما يكون إجمالي السلة صفراً. يقلل الخطوات ويزيد التحويلات للتحميلات المجانية.

source: Site Key
ar: مفتاح الموقع

source: Site Key format: 6LcExampleKey123ABCdef...
ar: صيغة مفتاح الموقع: 6LcExampleKey123ABCdef...

source: Skip cart, go directly to checkout
ar: تخطي السلة والذهاب مباشرة للدفع

source: Skip reCAPTCHA for administrator accounts
ar: تخطي reCAPTCHA لحسابات المسؤولين

source: Streamlines the buying process by sending customers directly to the checkout page immediately after they add a product to their cart, skipping the cart page entirely. Ideal for stores selling single items or wanting to reduce friction.
ar: يسرع عملية الشراء عبر إرسال العملاء مباشرة لصفحة الدفع فور إضافة المنتج للسلة، متخطياً صفحة السلة بالكامل. مثالي للمتاجر التي تبيع منتجات فردية أو تريد تقليل خطوات الشراء.

source: Subtotal (before tax/shipping)
ar: المجموع الفرعي (قبل الضريبة/الشحن)

source: Subtotal mode: Checks cart subtotal before tax and shipping are added
ar: وضع المجموع الفرعي: يتحقق من القيمة قبل إضافة الضرائب والشحن.

source: Success Message
ar: رسالة النجاح

source: Supported field IDs include: billing_first_name, billing_last_name, billing_company, billing_address_1, billing_city, billing_phone, etc.
ar: معرفات الحقول المدعومة تشمل: الاسم الأول، العائلة، الشركة، العنوان، المدينة، الهاتف، إلخ.

source: Suppress "Cart updated" messages
ar: إخفاء رسالة «تم تحديث السلة».

source: Suppress Add-to-Cart Message
ar: إخفاء رسالة إضافة للسلة

source: Test by adding a free product to your cart and proceeding to checkout.
ar: اختبر بإضافة منتج مجاني للسلة والانتقال لصفحة الدفع.

source: Test by adding items below minimum to cart and attempting checkout
ar: اختبر الميزة بإضافة عناصر أقل من الحد الأدنى للسلة ومحاولة إتمام الطلب.

source: Test by clicking "Add to Cart" on any product; you should land directly on the Checkout page.
ar: اختبر بالضغط على "إضافة للسلة" لأي منتج؛ يجب أن تنتقل مباشرة لصفحة الدفع.

source: Test by logging in as a non-admin user (subscriber, customer, etc.)
ar: اختبر الميزة بالدخول بحساب غير "مسؤول" (مثل مشترك أو عمال).

source: Test by logging out and trying to log in - you should see the reCAPTCHA checkbox
ar: اختبر الميزة بتسجيل الخروج ومحاولة الدخول مجدداً - سيظهر لك مربع reCAPTCHA

source: Test by logging out and visiting the login page - you'll see the math question
ar: اختبر بالخروج وزيارة صفحة تسجيل الدخول - سترى السؤال الرياضي.

source: Text to display for free products
ar: النص المعروض للمنتجات المجانية

source: Text used if the element has no original content.
ar: النص المستخدم إذا لم يكن للعنصر محتوى أصلي.

source: The Comments menu will disappear from WordPress admin
ar: ستختفي قائمة "التعليقات" من لوحة تحكم ووردبريس.

source: The element's content will change to the success message for 1.5 seconds after a successful copy.
ar: سيتغير محتوى العنصر إلى رسالة النجاح لمدة 1.5 ثانية بعد النسخ الناجح.

source: The minimum order amount is %s.
ar: الحد الأدنى لقيمة الطلب هو %s.

source: The original image will be deleted and replaced with a .webp version.
ar: سيتم حذف الصورة الأصلية واستبدالها بنسخة .webp.

source: The shortcode will output a clickable mailto link with spam protection
ar: سيقوم الكود المختصر بإخراج رابط بريد محمي وقابل للنقر.

source: These tags are legacy and rarely used by modern tools
ar: هذه الوسوم قديمة ونادراً ما تستخدم من قبل الأدوات الحديثة.

source: This feature relies on the Clipboard API and requires a secure connection (HTTPS) in most modern browsers.
ar: تعتمد هذه الميزة على واجهة برمجة تطبيقات الحافظة (Clipboard API) وتتطلب اتصالاً آمناً (HTTPS) في معظم المتصفحات الحديثة.

source: Timeout (seconds)
ar: المهلة الزمنية (ثوانٍ)

source: Timeout setting controls how long to wait for Google's API response (default 5 seconds)
ar: إعداد المهلة يتحكم في مدة انتظار استجابة API من جوجل (الافتراضي 5 ثوانٍ)

source: Timestamp URL generated!
ar: تم إنشاء رابط مُوقّت!

source: Tools
ar: أدوات

source: Total (after tax/shipping)
ar: المجموع (بعد الضريبة/الشحن)

source: Total mode: Checks final total including tax and shipping
ar: وضع المجموع الكلي: يتحقق من القيمة النهائية شاملة الضرائب والشحن.

source: Transparency: PNG transparency is preserved during conversion.
ar: الشفافية: يتم الحفاظ على شفافية صور PNG أثناء التحويل.

source: Type of admin notice
ar: نوع الإشعار الإداري

source: Unnecessary tags are immediately removed from your site's HTML head
ar: ستتم إزالة الوسوم غير الضرورية فوراً من رأس صفحة HTML لموقعك.

source: Unqueues comment-reply.js script to improve performance
ar: يلغي تحميل سكريبت comment-reply.js لتحسين الأداء.

source: Upload a new JPEG or PNG image to your Media Library.
ar: ارفع صورة JPEG أو PNG جديدة إلى مكتبة الوسائط.

source: Upload a new image to test - the filename will be converted to metadata
ar: ارفع صورة جديدة للاختبار - سيتم تحويل اسم الملف إلى بيانات ميتا.

source: Usage: [email]contact@yoursite.com[/email]
ar: الاستخدام: [email]contact@yoursite.com[/email]

source: Use %s for amount placeholder
ar: استخدم %s كبديل للمبلغ

source: Use CSS to hide honeypot field
ar: استخدام CSS لإخفاء حقل الفخ

source: User must type 11 to proceed with login
ar: يجب على المستخدم كتابة 11 لمتابعة عملية تسجيل الدخول.

source: Users with "manage_options" capability (usually Administrators) still see the admin bar
ar: المستخدمون الحاصلون على صلاحية "manage_options" (المسؤولون عادةً) سيظلون يطرون الشريط.

source: Uses AJAX to update the cart without a full page reload.
ar: يستخدم تقنية AJAX لتحديث السلة بدون إعادة تحميل كامل الصفحة.

source: Valid ID: GTM-ABC1234
ar: معرّف صحيح: GTM-ABC1234

source: Warning (Yellow)
ar: تحذير (أصفر)

source: WebP format is not supported on this server.
ar: صيغة WebP غير مدعومة على هذا الخادم.

source: What to compare against minimum
ar: ما يتم مقارنته بالحد الأدنى

source: When to set metadata
ar: متى يتم تعيين البيانات

source: Where to display the notice
ar: أين يتم عرض الإشعار

source: Where to inject the noscript tag.
ar: أين يتم إدراج وسم noscript.

source: WooCommerce
ar: ووكومرس

source: WordPress version is immediately hidden from public output
ar: سيتم إخفاء رقم الإصدار فوراً من المخرجات العامة للموقع.

source: Works alongside other login security features (reCAPTCHA, Math Captcha)
ar: يعمل جنباً إلى جنب مع ميزات أمان الدخول الأخرى (مثل reCAPTCHA والكابتشا الرياضية).

source: Works in posts, pages, custom post types, and text widgets that support shortcodes
ar: يعمل في المقالات، الصفحات، أنواع المقالات المخصصة، والودجت التي تدعم الأكواد المختصرة.

source: Works with all WordPress themes.
ar: يعمل مع كل قوالب ووردبريس.

source: XML-RPC is disabled on this site.
ar: XML-RPC معطّل على هذا الموقع.

source: XML-RPC is immediately disabled
ar: سيتم تعطيل XML-RPC فوراً.

source: XML-RPC is used by some mobile apps and legacy publishing tools (rarely needed today)
ar: يُستخدم XML-RPC من قبل بعض تطبيقات الهاتف وأدوات النشر القديمة (نادراً ما تبرز الحاجة له اليوم).

source: You do not have permission to access this page.
ar: ليس لديك صلاحية الوصول إلى هذه الصفحة.

source: reCAPTCHA site key not configured.
ar: مفتاح موقع reCAPTCHA غير مُعدّ.

source: reCAPTCHA verification failed.
ar: فشل التحقق من reCAPTCHA.

source: reCAPTCHA verification failed: %s
ar: فشل التحقق من reCAPTCHA: %s

source: QR Code Generator
ar: مولد رمز QR

source: Generate QR codes from URLs directly in the admin interface.
ar: إنشاء رموز QR من الروابط مباشرة في لوحة التحكم.

source: Enter the URL you want to convert into a QR code.
ar: أدخل الرابط الذي تريد تحويله إلى رمز QR.

source: Select the desired size for the QR code.
ar: اختر الحجم المطلوب لرمز QR.

source: Click "Generate QR" to preview the result.
ar: اضغط على "إنشاء رمز QR" لمعاينة النتيجة.

source: Click "Download QR" to save the image to your computer.
ar: اضغط على "تحميل رمز QR" لحفظ الصورة على جهازك.

source: This tool is for administrative use and does not output anything on the frontend.
ar: هذه الأداة للاستخدام الإداري فقط ولا تظهر أي شيء في الموقع من الخارج.

source: QR codes are generated locally in your browser.
ar: يتم إنشاء رموز QR محلياً في متصفحك.

source: URL
ar: الرابط

source: Size
ar: الحجم

source: Generate QR
ar: إنشاء رمز QR

source: Download QR
ar: تحميل رمز QR

source: QR code will appear here
ar: سيظهر رمز QR هنا

source: Please enter a valid URL
ar: الرجاء إدخال رابط صحيح

source: Provide an admin-only QR Code generator tool inside the feature card.
ar: توفير أداة لإنشاء رموز QR للإدارة فقط داخل بطاقة الميزة.

source: All Features
ar: كل المميزات

source: Disable User Enumeration
ar: منع كشف أسماء المستخدمين

source: Prevent attacker from discovering usernames via author archives and query parameters.
ar: تمنع هذه الميزة كشف أسماء المستخدمين عبر روابط author في WordPress.

source: User Enumeration is a technique where attackers discover registered usernames by scanning author archives or using specific query parameters like author=1.
ar: كشف أسماء المستخدمين (User Enumeration) هو تقنية يستخدمها المهاجمون لمعرفة أسماء المستخدمين المسجلين في الموقع عبر طلبات معينة مثل author=1.

source: Any attempt to access author archives or enumeration query parameters will be redirected to the home page.
ar: سيتم تلقائياً تحويل أي محاولة للوصول لروابط المؤلفين (author archives) أو البارامترات مثل ?author=ID إلى الصفحة الرئيسية.

source: Security Risk: Knowing a username is the first step in a brute force attack.
ar: خطر أمني: معرفة اسم المستخدم هو الخطوة الأولى في هجمات التخمين (Brute Force).

source: This feature does not affect the WordPress admin or REST API.
ar: هذه الميزة لا تؤثر على لوحة التحكم أو واجهة البرمجة (REST API).

source: IMPORTANT NOTE: If you are using another security plugin or WAF that provides the same protection, disable one of them to avoid conflicts.
ar: ملاحظة هامة: إذا كنت تستخدم إضافة أمان أخرى توفر نفس الحماية، يرجى تعطيل أحدهما لتجنب التعارض.

source: Security Headers
ar: ترويسات الأمان (Security Headers)

source: Add essential security headers to improve site and browser protection.
ar: تضيف هذه الميزة ترويسات أمان مهمة لتحسين حماية الموقع والمتصفح.

source: Security headers are HTTP headers sent by the server to the browser to enable additional protection layers that prevent attacks like XSS, Clickjacking, and Content Sniffing.
ar: ترويسات الأمان هي ترويسات HTTP يرسلها الخادم للمتصفح لتفعيل طبقات حماية إضافية تمنع هجمات مثل XSS و Clickjacking و Content Sniffing.

source: Enable the main feature then choose the headers you want to activate below.
ar: قم بتفعيل الميزة الرئيسية ثم اختر الترويسات التي تريد تفعيلها أدناه.

source: Click "Save Changes" to apply settings.
ar: اضغط على "حفظ التغييرات" لتطبيق الإعدادات.

source: You can verify headers via browser developer tools (Network tab).
ar: يمكنك التحقق من الترويسات عبر أدوات المطور في المتصفح (تبويب Network).

source: X-Content-Type-Options: Prevents the browser from guessing the file type (Sniffing).
ar: X-Content-Type-Options: يمنع المتصفح من تخمين نوع الملف (Sniffing).

source: X-Frame-Options: Prevents your site from being displayed in an iframe to protect against Clickjacking attacks.
ar: X-Frame-Options: يمنع عرض موقعك داخل iframe لحماية من هجمات Clickjacking.
