Repository: MajedBannani/ArBricks
Catalog: languages/arbricks-*.po
Languages: ar

source: Referrer-Policy: Controls information sent when navigating from your site to another.
ar: Referrer-Policy: يتحكم في المعلومات المرسلة عند الانتقال من موقعك لموقع آخر.

source: Permissions-Policy: Reduces browser permissions like camera and geolocation.
ar: Permissions-Policy: يقلل الصلاحيات المتاحة للمتصفح مثل الكاميرا والموقع الجغرافي.

source: HSTS: Forces the browser to connect via HTTPS only.
ar: HSTS: يجبر المتصفح على الاتصال عبر HTTPS فقط.

source: NOTE: If you use Cloudflare or another security plugin that already adds these headers, disable duplicates.
ar: تنبيه: إذا كنت تستخدم Cloudflare أو إضافة أمان أخرى تضيف هذه الترويسات بالفعل، يفضل تعطيل المكرر منها.

source: HSTS WARNING: Only enable this if your site is fully stable on HTTPS. Misconfiguration can block site access.
ar: تحذير HSTS: لا تقم بتفعيله إلا إذا كان موقعك يعمل عبر HTTPS بشكل مستقر تماماً، قد يؤدي سوء الإعداد لمنع الوصول للموقع.

source: Prevent browser from content-type sniffing.
ar: منع المتصفح من تخمين نوع المحتوى.

source: Protection against Clickjacking attacks.
ar: الحماية من هجمات Clickjacking.

source: Control Referrer information.
ar: التحكم في بيانات الـ Referrer.

source: Reduce browser permissions (camera, mic, geo).
ar: تقليل صلاحيات المتصفح (كاميرا، ميكروفون، موقع).

source: Force HTTPS (Use with caution).
ar: إجبار المتصفح على HTTPS (استخدمه بحذر).

source: Hide Sensitive WP Files
ar: إخفاء ملفات ووردبريس الحساسة

source: Prevent direct access to sensitive WordPress files that may reveal site information.
ar: تمنع هذه الميزة الوصول المباشر لبعض ملفات ووردبريس الحساسة التي قد تكشف معلومات عن الموقع.

source: WordPress contains default files that may reveal system version or server information to attackers. This feature prevents direct access to these files.
ar: يحتوي ووردبريس على ملفات افتراضية قد تكشف عن إصدار النظام أو معلومات الخادم للمهاجمين. هذه الميزة تقوم بمنع الوصول المباشر لهذه الملفات.

source: Access to sensitive files will be automatically blocked for direct requests.
ar: سيتم تلقائياً منع الوصول لأي شخص يحاول فتح الملفات الحساسة مباشرة.

source: Protected files: readme.html, readme.txt, install.php, wp-config.php, debug.log, error_log, .htaccess, .htpasswd.
ar: الملفات المحمية: readme.html, readme.txt, install.php, wp-config.php, debug.log, error_log, .htaccess, .htpasswd.

source: A 404 (Not Found) error is returned to imply the file does not exist.
ar: يتم إرجاع خطأ 404 (غير موجود) للإيحاء بأن الملف غير موجود أصلاً.

source: This feature does not affect internal site operations or the admin dashboard.
ar: هذه الميزة لا تؤثر على عمل الموقع داخلياً أو لوحة التحكم.

source: IMPORTANT NOTE: If your server (Nginx/Apache) already blocks these files, you do not need to enable this feature.
ar: ملاحظة هامة: إذا كان خادمك (Nginx/Apache) يقوم بالفعل بمنع هذه الملفات، فلن تحتاج لتفعيل هذه الميزة.

source: Block PHP Uploads
ar: منع رفع ملفات PHP داخل مجلد uploads

source: Prevent uploading PHP files within the uploads directory to protect against malicious scripts.
ar: تمنع هذه الميزة رفع أو تنفيذ ملفات PHP داخل مجلد uploads لحماية الموقع من محاولات الاختراق.

source: Allowing PHP uploads is a serious security risk that could allow attackers to execute malicious code on your server. This feature blocks the upload of any file with a PHP-related extension.
ar: السماح برفع ملفات PHP هو ثغرة أمنية خطيرة قد تسمح للمهاجمين بتنفيذ أكواد برمجية خبيثة على خادمك. تقوم هذه الميزة بمنع رفع أي ملف يحمل امتداد متعلق بـ PHP.

source: When attempting to upload a PHP file via the media library, the operation will be rejected and an error message will be shown.
ar: عند محاولة رفع ملف PHP عبر مكتبة الوسائط، سيتم رفض العملية وإظهار رسالة خطأ.

source: Blocked extensions: .php, .phtml, .php3, .php4, .php5, .phar.
ar: الملفات الممنوعة: .php, .phtml, .php3, .php4, .php5, .phar.

source: This feature does not prevent uploading normal images or documents (jpg, png, pdf, etc).
ar: هذه الميزة لا تمنع رفع الصور أو المستندات العادية (jpg, png, pdf, etc).

source: The feature does not scan previously uploaded files, but focuses on new upload operations.
ar: لا تقوم الميزة بفحص الملفات المرفوعة مسبقاً، بل تركز على عمليات الرفع الجديدة.

source: IMPORTANT NOTE: If you use a plugin that needs to upload PHP files (very rare), you may need to disable this feature.
ar: ملاحظة هامة: إذا كنت تستخدم إضافة تحتاج لرفع ملفات PHP (نادر جداً)، فقد تحتاج لتعطيل هذه الميزة.

source: Sorry, PHP files are not allowed for security reasons.
ar: عذراً، لا يُسمح برفع ملفات PHP لأسباب أمنية.

source: Admin Post Status Colors
ar: تمييز حالات المقالات بالألوان

source: Highlight post rows with subtle colors based on their status (Draft, Pending, etc.) in the admin area.
ar: تضيف هذه الميزة ألوانًا خفيفة لصفوف المقالات حسب حالتها لتسهيل التمييز البصري داخل لوحة التحكم.

source: This feature adds subtle background colors to post list table rows based on their status, making it easier to visually distinguish between drafts, scheduled, and private posts.
ar: تقوم هذه الميزة بإضافة ألوان خلفية خفيفة لصفوف جدول المقالات حسب حالتها، مما يسهل التمييز البصري السريع بين المسودات والمقالات المجدولة والخاصة.

source: Enable the main feature then choose the statuses you want to colorize from the options below.
ar: قم بتفعيل الميزة الرئيسية ثم اختر الحالات التي تريد تلوينها من الخيارات أدناه.

source: Go to the Posts (or Pages) list to see the color effect.
ar: انتقل إلى قائمة المقالات (أو الصفحات) لمشاهدة تأثير الألوان.

source: Supported statuses: Draft, Pending Review, Scheduled (Future), and Private.
ar: الحالات المدعومة: مسودة (Draft)، قيد المراجعة (Pending)، مجدولة (Future)، خاص (Private).

source: Colors are designed to be very light and do not affect text readability.
ar: الألوان مصممة لتكون خفيفة جداً ولا تؤثر على قراءة النص.

source: Works across all posts, pages, and custom post type tables.
ar: تعمل الميزة في كافة جداول المقالات والصفحات وأنواع المقالات المخصصة.

source: NOTE: If your theme or another plugin already modifies table colors, you may see visual overlaps.
ar: ملاحظة: إذا كان القالب أو إضافة أخرى تقوم بتعديل ألوان الجدول، قد يظهر تداخل بصري.

source: Color Drafts
ar: تلوين المسودات

source: Color draft posts with a light yellow background.
ar: تلوين المسودات باللون الأصفر الخفيف.

source: Color Pending
ar: تلوين قيد المراجعة

source: Color pending review posts with a light blue background.
ar: تلوين المقالات قيد المراجعة باللون الأزرق الخفيف.

source: Color Scheduled
ar: تلوين المجدولة

source: Color scheduled posts with a light green background.
ar: تلوين المقالات المجدولة باللون الأخضر الخفيف.

source: Color Private
ar: تلوين المقالات الخاصة

source: Color private posts with a light red background.
ar: تلوين المقالات الخاصة باللون الأحمر الخفيف.

source: Admin Show Post ID
ar: إظهار ID المقالات والصفحات

source: Show post and page IDs in the admin table columns for easier development and management.
ar: تضيف هذه الميزة عمودًا يعرض ID المقال أو الصفحة داخل جداول الإدارة لتسهيل العمل والتطوير.

source: This feature adds a new column to the admin tables that displays the unique ID for each post or page, making it easier to work with shortcodes or during development.
ar: تضيف هذه الميزة عموداً جديداً في جداول الإدارة يعرض الرقم التعريفي (ID) لكل مقال أو صفحة، مما يسهل العمل عند استخدام الأكواد القصيرة (Shortcodes) أو في عمليات التطوير.

source: Navigate to the Posts or Pages list and a new "ID" column will appear.
ar: انتقل إلى قائمة المقالات أو الصفحات وسيظهر عمود جديد باسم "ID".

source: The feature works on the Posts list and Pages list by default.
ar: تعمل الميزة في قائمة المقالات (Posts) وقائمة الصفحات (Pages) بشكل افتراضي.

source: This column is for display only and is not intended for sorting.
ar: هذا العمود للعرض فقط وليس مخصصاً للفرز (Sorting).

source: NOTE: If another plugin already displays the ID, you may see duplicate columns. Disable one to avoid repetition.
ar: ملاحظة: إذا كانت هناك إضافة أخرى تعرض الـ ID بالفعل، فقد يظهر العمود مرتين. قم بتعطيل أحدهما لتفادي التكرار.

source: Clean Dashboard
ar: تنظيف لوحة التحكم

source: Declutter your WordPress dashboard by hiding default widgets you do not use.
ar: تتيح هذه الميزة إخفاء بعض Widgets الافتراضية من لوحة التحكم لتقليل التشويش وتحسين تجربة الإدارة.

source: This feature helps you customize the dashboard by hiding default widgets you do not need, giving you a cleaner and faster administrative interface.
ar: تساعدك هذه الميزة على تخصيص لوحة التحكم (الدشبرد) عبر إخفاء الصناديق الافتراضية التي لا تحتاجها، مما يمنحك واجهة إدارة أنظف وأسرع.

source: Click "Save Changes" to see the result on the main dashboard.
ar: اضغط على "حفظ التغييرات" لرؤية النتيجة في لوحة التحكم الرئيسية.

source: Available widgets to hide: At a Glance, Quick Draft, Activity, Recent Comments, and WordPress News.
ar: الصناديق المتاحة للإخفاء: حالة الموقع، المسودة السريعة، النشاط، التعليقات الأخيرة، وأخبار ووردبريس.

source: This feature does not delete data; it only hides the widgets from view.
ar: هذه الميزة لا تحذف البيانات، بل تخفي الصنادق من العرض فقط.

source: You can re-enable any widget at any time by unchecking it here.
ar: يمكنك إعادة إظهار أي صندوق في أي وقت عبر إلغاء تحديده هنا.

source: NOTE: Some other plugins may add their own widgets; this feature focuses on default WordPress widgets.
ar: ملاحظة: بعض الإضافات الأخرى قد تضيف صناديقها الخاصة، هذه الميزة تركز على صناديق ووردبريس الافتراضية.

source: Hide "At a Glance"
ar: إخفاء "لمحة سريعة"

source: Hide the "At a Glance" widget that shows post and page counts.
ar: إخفاء صندوق "لمحة سريعة" الذي يعرض عدد المقالات والصفحات.

source: Hide "Activity"
ar: إخفاء "النشاط"

source: Hide the "Activity" widget that shows recent posts and comments.
ar: إخفاء صندوق "النشاط" الذي يعرض آخر المقالات والتعليقات.

source: Hide "Quick Draft"
ar: إخفاء "مسودة سريعة"

source: Hide the "Quick Draft" widget for writing quick post ideas.
ar: إخفاء صندوق "مسودة سريعة" لكتابة أفكار المقالات بسرعة.

source: Hide "Recent Comments"
ar: إخفاء "التعليقات الأخيرة"

source: Hide the "Recent Comments" widget.
ar: إخفاء صندوق "التعليقات الأخيرة".

source: Hide "WordPress Events and News"
ar: إخفاء "أخبار وفعاليات ووردبريس"

source: Hide the widget that displays official WordPress news.
ar: إخفاء الصندوق الذي يعرض أخبار ووردبريس الرسمية.

source: Hide "Welcome Panel"
ar: إخفاء "لوحة الترحيب"

source: Hide the Welcome panel that appears on the dashboard.
ar: إخفاء لوحة الترحيب التي تظهر في المرة الأولى.

source: Login with Email
ar: تسجيل الدخول باستخدام البريد الإلكتروني

source: Allow users to log in using their email address or username instead of just username.
ar: تتيح هذه الميزة تسجيل الدخول باستخدام البريد الإلكتروني أو اسم المستخدم بدلاً من اسم المستخدم فقط.

source: This feature allows users to log in using their email address instead of just their username, making it easier to access the site.
ar: تتيح هذه الميزة للمستخدمين تسجيل الدخول باستخدام البريد الإلكتروني الخاص بهم بدلاً من اسم المستخدم فقط، مما يسهل عملية الوصول للموقع.

source: Now users can enter their email address in the "Username" field on the login page.
ar: الآن يمكن للمستخدمين كتابة بريدهم الإلكتروني في خانة "اسم المستخدم" في صفحة الدخول.

source: This feature works by converting the entered email to its corresponding username before authentication begins.
ar: تعمل هذه الميزة عبر تحويل البريد الإلكتروني المدخل لاسم المستخدم المطابق له قبل بدء عملية التحقق.

source: The feature does not change the login page UI or any error messages.
ar: لا تقوم الميزة بتغيير واجهة صفحة الدخول أو الرسائل التي تظهر.

source: IMPORTANT NOTE: If you use a security plugin that customizes the login process (like 2FA or OTP), a conflict may occur. Disable one of them if you encounter issues.
ar: ملاحظة هامة: إذا كنت تستخدم إضافة أمان تخصص عملية الدخول (مثل 2FA أو OTP)، فقد يحدث تداخل. قم بتعطيل إحداهما إذا واجهت مشاكل.

source: Two-Factor Authentication (2FA)
ar: التحقق بخطوتين (2FA)

source: Add an extra layer of security using authentication apps like Google Authenticator.
ar: تضيف هذه الميزة طبقة أمان إضافية عبر التحقق بخطوتين باستخدام تطبيقات المصادقة مثل Google Authenticator.

source: Two-Factor Authentication (2FA) is one of the most important ways to secure accounts. Once activated, you will be required to enter a temporary code from an authentication app on your phone after entering your password.
ar: تعد خطوة التحقق الإضافية (2FA) من أهم وسائل تأمين الحسابات. بعد تفعيلها، سيُطلب منك إدخال رمز مؤقت من تطبيق المصادقة على هاتفك بعد كتابة كلمة المرور.

source: Enable the main feature toggle above.
ar: قم بتفعيل الميزة الرئيسية من الزر أعلاه.

source: Click on the "Setup Two-Factor Authentication" button below.
ar: اضغط على زر "إعداد التحقق بخطوتين" بالأسفل.

source: Scan the QR Code using an app like Google Authenticator or Microsoft Authenticator.
ar: امسح الرمز الظاهر (QR Code) باستخدام تطبيق مثل Google Authenticator أو Microsoft Authenticator.

source: Enter the 6-digit code to verify the setup and activate it.
ar: أدخل الرمز المكون من 6 أرقام للتحقق من الإعداد وتنشيطه.

source: This feature is currently for Administrators only to ensure maximum protection.
ar: تعمل هذه الميزة حالياً للمدراء (Administrators) فقط لضمان أقصى درجات الحماية للموقع.

source: Supported apps: Google Authenticator, Microsoft Authenticator, Authy, and other TOTP apps.
ar: التطبيقات المدعومة: Google Authenticator, Microsoft Authenticator, Authy وغيرها من تطبيقات TOTP.

source: WARNING: Do not delete the account from your app after activation until you disable the feature here, or you may lose access.
ar: تنبيه: لا تقم بحذف الحساب من التطبيق بعد التفعيل إلا بعد تعطيل الميزة هنا، وإلا فقد تفقد القدرة على الدخول.

source: IMPORTANT NOTE: If you use another security plugin for login, a conflict may occur. Enable only one 2FA system.
ar: ملاحظة هامة: إذا كنت تستخدم إضافة أمان تخصص عملية الدخول، فقد يحدث تداخل. قم بتفعيل نظام 2FA واحد فقط.

source: Apply to Administrators only (Recommended)
ar: تطبيق على المدراء فقط (موصى به)

source: Apply two-factor authentication only to administrator accounts.
ar: تطبيق التحقق بخطوتين على حسابات المدراء فقط.

source: Generating...
ar: جاري التحميل...

source: Verifying...
ar: جاري التحقق...

source: Setup Two-Factor Authentication
ar: إعداد التحقق بخطوتين (2FA)

source: Verify and Activate
ar: تحقق وتنشيط

source: Are you sure you want to disable 2FA? This will reduce your account security.
ar: هل أنت متأكد من تعطيل التحقق بخطوتين؟ هذا سيقلل من أمان حسابك.

source: Permission denied
ar: غير مسموح بالدخول

source: No setup in progress.
ar: لا توجد عملية إعداد قيد التنفيذ.

source: Invalid 2FA code. Please try again.
ar: رمز غير صحيح، حاول مجدداً.

source: 2FA Code (If enabled)
ar: رمز التحقق (2FA)

source: Please enter your 2FA code.
ar: يرجى إدخال رمز التحقق بخطوتين.

source: Invalid 2FA code.
ar: رمز التحقق غير صحيح.

source: 2FA is Active
ar: التحقق بخطوتين مفعل

source: Your account is protected with Two-Factor Authentication.
ar: حسابك محمي الآن باستخدام ميزة التحقق بخطوتين.

source: Disable 2FA
ar: تعطيل التحقق

source: Setup Steps:
ar: خطوات الإعداد:

source: Scan this QR code with your Authenticator app:
ar: 1. امسح هذا الرمز باستخدام تطبيق المصادقة:

source: Or enter this secret key manually:
ar: 2. أو أدخل هذا الرمز السري يدوياً:

source: Enter the 6-digit code from the app to verify:
ar: 3. أدخل الرمز المكون من 6 أرقام للتنشيط:

source: Block Hotlinking
ar: منع الربط المباشر للوسائط (Hotlinking)

source: Prevent other sites from using your images directly, saving your bandwidth and server resources.
ar: تمنع هذه الميزة المواقع الأخرى من استخدام صورك ووسائطك مباشرة دون إذن، مما يساعد على تقليل استهلاك الموارد.

source: Hotlinking is when other sites use your image URLs inside their own pages, consuming your bandwidth instead of theirs. This feature prevents unauthorized access to your media files.
ar: الربط المباشر أو (Hotlinking) هو قيام مواقع أخرى باستخدام روابط صورك ووسائطك داخل صفحاتهم، مما يستهلك استهلاك البيانات (Bandwidth) الخاص بك بدلاً منهم. تمنع هذه الميزة محاولات الوصول غير المصرح بها لصورك.

source: Enable the main feature and choose your preferred block method.
ar: قم بتفعيل الميزة الرئيسية وتعيين طريقة المنع المفضلة.

source: You can choose to show a 403 error or serve a placeholder image (like your logo).
ar: يمكنك اختيار إظهار خطأ 403 أو عرض صورة بديلة (مثل شعار موقعك).

source: Add friendly domains you want to allow to the whitelist.
ar: أضف النطاقات الصديقة التي تريد السماح لها بالاستخدام في القائمة البيضاء.

source: Search engines (Google, Bing, etc.) and direct access are allowed automatically to ensure SEO is not affected.
ar: يتم السماح لمحركات البحث (جوجل، بينج، إلخ) والوصول المباشر تلقائياً لضمان عدم تأثر السيو.

source: WARNING: If you use a CDN or a separate media domain, make sure to add it to the whitelist.
ar: تنبيه: إذا كنت تستخدم شبكة توصيل محتوى (CDN) أو موقعاً منفصلاً للوسائط، تأكد من إضافة النطاق الخاص بها للقائمة البيضاء.

source: NOTE: This feature runs via PHP and may have a very small impact on performance on extremely large sites; in such cases, server-level protection is preferred.
ar: ملاحظة: هذه الميزة تعمل عبر ملفات بي إتش بي وقد يكون لها تأثير بسيط جداً على الأداء إذا كان الموقع ضخماً جداً، في هذه الحالة يفضل الحماية عبر الخادم نفسه.

source: Allow Search Engines
ar: السماح لمحركات البحث

source: Allow search engines like Google and Bing to display your images.
ar: السماح لمحركات البحث مثل Google و Bing بعرض صورك.

source: Allowed Domains (Whitelist)
ar: النطاقات المسموح بها (Whitelist)

source: Enter domains allowed to use your images (one per line). Example: sub.domain.com
ar: أدخل النطاقات المسموح لها باستخدام صورك (نطاق واحد في كل سطر). مثال: sub.domain.com

source: Block Method
ar: طريقة المنع

source: Choose what happens when a hotlink attempt is detected.
ar: اختر ماذا يحدث عند كشف محاولة ربط مباشرة.

source: Placeholder Image
ar: صورة بديلة

source: Placeholder Image URL
ar: رابط الصورة البديلة

source: URL of the image to display instead of the blocked one (used with Placeholder option).
ar: رابط الصورة التي سيتم عرضها بدلاً من الصورة المحرومة (تستخدم فقط مع خيار الصورة البديلة).

source: Limit Login Attempts
ar: تقييد محاولات تسجيل الدخول

source: Protect your site from brute force attacks by limiting failed login attempts through all login forms.
ar: تحمي هذه الميزة الموقع من هجمات التخمين (Brute Force) عبر تقييد عدد محاولات الدخول الفاشلة لجميع النماذج.

source: Brute force attacks are repeated attempts by hackers to guess passwords to gain access to your account. This feature blocks any IP address that exceeds a certain number of failed attempts for a specified period.
ar: هجمات التخمين (Brute Force) هي محاولات متكررة من قبل المخترقين لتجربة آلاف كلمات المرور للوصول إلى حسابك. تقوم هذه الميزة بمنع أي عنوان IP يتجاوز عدداً معيناً من المحاولات الفاشلة لفترة زمنية محددة.

source: Enable the feature and set the maximum attempts and lockout duration.
ar: قم بتفعيل الميزة وضبط الحد الأقصى للمحاولات ومدة الحظر.

source: When the limit is exceeded, the IP address will be automatically blocked from further attempts.
ar: عند تجاوز الحد، سيتم حظر عنوان IP تلقائياً ومنعه من المحاولة مرة أخرى.

source: Attempts are automatically reset upon a successful login.
ar: يتم تصفير المحاولات تلقائياً عند تسجيل الدخول بنجاح.

source: This feature protects all login forms including default WordPress, WooCommerce, and other membership forms.
ar: تحمي هذه الميزة جميع نماذج الدخول بما في ذلك ووردبريس الافتراضي، ووكومرس، ونماذج العضوية الأخرى.

source: This feature does not affect the REST API or automated system operations.
ar: لا تؤثر هذه الميزة على REST API أو العمليات التلقائية للنظام.

source: IMPORTANT NOTE: If you are using another security plugin that provides similar functionality, please enable only one to avoid conflicts.
ar: ملاحظة هامة: إذا كنت تستخدم إضافة أمان أخرى تقوم بنفس الوظيفة، يرجى تفعيل واحدة فقط لتجنب التعارض.

source: If you are accidentally locked out, you can wait for the lockout to expire or disable the feature via direct file access if necessary.
ar: في حالة تم حظرك بالخطأ، يمكنك الانتظار حتى انتهاء مدة الحظر أو تعطيل الميزة عبر الوصول المباشر للملفات إذا لزم الأمر.

source: Maximum Failed Attempts
ar: أقصى عدد من المحاولات

source: Number of failed attempts allowed before lockout (Default: 5).
ar: عدد المحاولات الفاشلة المسموح بها قبل الحظر (الافتراضي: 5).

source: Lockout Duration (Minutes)
ar: مدة الحظر (بالدقائق)

source: Duration the IP address will be blocked in minutes (Default: 15).
ar: مدة حظر عنوان IP بالدقائق (الافتراضي: 15).

source: Reset Attempts on Success
ar: تصفير المحاولات عند النجاح

source: Reset the failed attempts counter after a successful login.
ar: تصفير عداد المحاولات الفاشلة عند تسجيل الدخول بنجاح.

source: Protection Scope
ar: نطاق الحماية

source: Choose which forms you want to protect.
ar: اختر النماذج التي تريد حمايتها.

source: All login forms (Recommended)
ar: جميع نماذج الدخول (موصى به)

source: Default wp-login.php only
ar: نموذج ووردبريس الافتراضي فقط

source: <strong>Error</strong>: Too many failed login attempts. Please try again later.
ar: <strong>خطأ</strong>: تم تجاوز عدد محاولات الدخول الفاشلة. يرجى المحاولة مرة أخرى لاحقاً.

source: SEO Spam Link Audit
ar: تدقيق الروابط الخارجية (SEO Spam)

source: Audit tool to extract all external links from your content and identify suspicious domains.
ar: تساعدك هذه الأداة على استخراج الروابط الخارجية من المحتوى واكتشاف الدومينات المشبوهة التي قد تكون مرتبطة بـ SEO Spam.

source: The Link Audit tool helps you discover hidden or suspicious external links that may be added to your site through comments or content injections for SEO Spam purposes. This tool helps you clean your site and improve its quality.
ar: أداة تدقيق الروابط تساعدك على اكتشاف الروابط الخارجية المخفية أو المشبوهة التي قد تضاف لموقعك عبر التعليقات أو اختراقات المحتوى بهدف سيو سبام (SEO Spam). تساعدك هذه الأداة على تنظيف موقعك وتحسين جودته.

source: Enable the feature to show the scan form below.
ar: قم بتفعيل الميزة ليظهر لك نموذج الفحص بالأسفل.

source: Choose the scan scope (Posts, Pages, or Comments) and the maximum number of items.
ar: اختر نطاق الفحص (مواضيع، صفحات، أو تعليقات) والعدد الأقصى للعناصر.

source: Click "Scan Now" to start extracting and analyzing links.
ar: اضغط على "فحص الآن" لتبدأ الأداة باستخراج الروابط وتحليلها.

source: Review the resulting table and pay attention to domains flagged as "Suspicious".
ar: راجع الجدول الناتج وانتبه للنطاقات التي تظهر بجانبها علامة "مشبوه".

source: This tool is read-only and does not automatically delete or modify any content.
ar: هذه الأداة للقراءة فقط ولا تقوم بحذف أو تعديل أي محتوى تلقائياً.

source: Links are classified as suspicious based on technical criteria such as domain length, number of hyphens, or use of cheap TLDs known for spam.
ar: يتم تصنيف الروابط كمشبوهة بناءً على معايير فنية مثل طول الدومين، كثرة الشرطات، أو استخدام لاحقات نطاق رخيصة ومشهورة بالسبام.

source: If you find suspicious links, make sure to review their content and delete them manually if they are confirmed to be spam.
ar: إذا وجدت روابط مشبوهة، تأكد من مراجعة المحتوى الخاص بها وحذفها يدوياً إذا ثبت أنها سبام.

source: Scan Scope
ar: نطاق الفحص

source: Posts + Pages
ar: المواضيع + الصفحات

source: Posts Only
ar: المواضيع فقط

source: Pages Only
ar: الصفحات فقط

source: Items Limit
ar: عدد العناصر

source: Include Comments
ar: تضمين التعليقات

source: Scan Now
ar: فحص الآن

source: Domain
ar: النطاق

source: Links Found
ar: الروابط المكتشفة

source: Status
ar: الحالة

source: Examples / Location
ar: أمثلة / المواقع

source: Scanning...
ar: جاري الفحص...

source: Scanned:
ar: تم فحص:

source: items.
ar: عنصر.

source: External domains found.
ar: نطاق خارجي مكتشف.

source: No external links found.
ar: لم يتم العثور على روابط خارجية.

source: Suspicious
ar: مشبوه

source: Safe
ar: آمن

source: SEO Spam Content Scan
ar: فحص المحتوى لاكتشاف SEO Spam
