Repository: MajedBannani/ArBricks
Catalog: languages/arbricks-*.po
Languages: ar

source: Scan your posts and pages for suspicious patterns like hidden text, obfuscated code, or spam keywords.
ar: تفحص هذه الأداة محتوى المقالات والصفحات لاكتشاف أنماط مشبوهة قد تشير إلى SEO Spam أو محتوى محقون.

source: This tool scans your site's content for "SEO Spam" indicators. This technique is used by hackers to add hidden links or keywords to your site to improve other sites' search engine rankings, which can damage your site's reputation.
ar: تقوم هذه الأداة بفحص محتوى موقعك للبحث عن علامات "سيو سبام" (SEO Spam). هذه التقنية يستخدمها المخترقون لإضافة روابط أو كلمات دليلة مخفية لموقعك بهدف تحسين ترتيب مواقع أخرى في محركات البحث، مما قد يضر بسمعة موقعك.

source: Enable the feature and adjust the scan options (Count and Scope).
ar: فعل الميزة واضبط خيارات الفحص (العدد والنطاق).

source: Click "Scan Now" to start analyzing the content code.
ar: اضغط على "فحص الآن" لتبدأ الأداة بتحليل كود المحتوى.

source: Review the resulting list and pay attention to items with a "High" risk level.
ar: راجع القائمة الناتجة وانتبه للعناصر ذات "مستوى الخطورة" العالي.

source: Use the direct "Edit" link to review and remove suspicious content if necessary.
ar: استخدم رابط "تعديل" المباشر لمراجعة المحتوى المشبوه وحذفه إذا لزم الأمر.

source: This tool is for auditing purposes only and does not change anything in the database.
ar: هذه الأداة للتدقيق فقط ولا تغير أي شيء في قاعدة البيانات.

source: The tool looks for text hidden via CSS, encrypted code (Base64), or suspicious keywords.
ar: تبحث الأداة عن نصوص مخفية عبر CSS، كود برمجي مشفر (Base64)، أو كلمات دلالية مشبوهة.

source: Warning: Some themes may use hidden text for legitimate design purposes, so manual review is always required before taking action.
ar: تنبيه: بعض القوالب قد تستخدم نصوصاً مخفية لأغراض تصميم مشروعة، لذا يجب دائماً المراجعة اليدوية قبل اتخاذ أي قرار.

source: Include Private Content
ar: تضمين المحتوى الخاص (Private)

source: Detected Issues
ar: المشاكل المكتشفة

source: Risk Level
ar: مستوى الخطورة

source: Actions
ar: الإجراءات

source: Suspicious items found.
ar: محتوى مشبوه مكتشف.

source: No suspicious indicators found.
ar: لم يتم العثور على أي مؤشرات مشبوهة.

source: Risk:
ar: الخطورة:

source: Edit
ar: تعديل

source: Hidden via CSS (Display)
ar: مخفي عبر CSS (Display)

source: Hidden via CSS (Visibility)
ar: مخفي عبر CSS (Visibility)

source: Hidden via CSS (Opacity)
ar: مخفي عبر CSS (Opacity)

source: Hidden via CSS (Zero Font)
ar: مخفي عبر CSS (حجم خط صفر)

source: Spam Keywords
ar: كلمات سبام دلالية

source: High Link Density
ar: كثافة روابط عالية

source: Redirect Anomaly Check
ar: فحص إعادة التوجيه المشبوهة

source: Detect suspicious redirects that may target search engine bots differently than regular users.
ar: تساعدك هذه الأداة على اكتشاف مؤشرات لإعادة توجيه مشبوهة قد تؤثر على الزوار أو محركات البحث (SEO Spam).

source: SEO Spam attacks sometimes use conditional redirects that appear only to search engine bots to hide malicious content from the site owner. This tool simulates both regular visits and search engine crawls to compare behaviors.
ar: تستخدم هجمات "سيو سبام" (SEO Spam) أحياناً إعادة توجيه مشروطة تظهر فقط لمحركات البحث (Bot) لإخفاء وجود محتوى ضار عن صاحب الموقع. تقوم هذه الأداة بمحاكاة زيارة الزائر العادي وزيارة محرك البحث للمقارنة بينهما.

source: Enable the feature and set the scan scope (Homepage only or with a sample of posts).
ar: فعل الميزة واضبط نطاق الفحص (الرئيسية فقط أو مع عينة من المقالات).

source: Ensure the search bot simulation option is enabled to compare behaviors.
ar: تأكد من تفعيل خيار محاكاة محرك البحث للمقارنة بين السلوكيات.

source: Click "Scan Now" to start requesting links and analyzing the redirect chain.
ar: اضغط على "فحص الآن" لتبدأ الأداة بطلب الروابط وتحليل سلسلة التحويلات.

source: Review the results and pay attention to any redirects that take you to an unknown external domain.
ar: راجع النتائج وانتبه لأي تحويلات تأخذك لنطاق خارجي غير معروف.

source: This tool is for auditing only and does not change any settings on your site or server.
ar: هذه الأداة للتدقيق فقط ولا تغير أي إعدادات في موقعك أو خادمه.

source: Some normal redirects may appear, such as HTTP to HTTPS or non-WWW to WWW.
ar: قد تظهر بعض التحويلات الطبيعية مثل التحويل من HTTP إلى HTTPS أو من non-WWW إلى WWW.

source: If you find completely different behavior between a regular user and a search bot for the same link, it is a strong indicator of an SEO spam issue.
ar: إذا وجدت سلوكاً مختلفاً تماماً بين الزائر العادي ومحرك البحث لنفس الرابط، فهذا مؤشر قوي على وجود مشكلة سيو سبام.

source: Redirects to external domain
ar: إعادة توجيه لنطاق خارجي

source: Multiple redirect hops
ar: تحويلات متعددة (Hops)

source: Discrepancy: Bot redirected to different URL
ar: تعارض: البوت يتم توجيهه لرابط مختلف

source: Discrepancy: Different redirect chain length
ar: تعارض: اختلاف في طول سلسلة التحويل

source: Homepage Only
ar: الصفحة الرئيسية فقط

source: Homepage + 3 random posts
ar: الرئيسية + 3 مقالات عشوائية

source: Homepage + 10 random posts
ar: الرئيسية + 10 مقالات عشوائية

source: Simulate Search Bot (Googlebot)
ar: محاكاة محرك البحث (Googlebot)

source: Status Chain
ar: سلسلة الحالات

source: Risk & Issues
ar: المخاطر والمشاكل

source: No issues detected
ar: لم يتم اكتشاف مشاكل

source: Disable RSS Feeds
ar: تعطيل خلاصات RSS

source: Disable RSS feeds for posts or comments to reduce spam surface and unnecessary server access.
ar: تتيح هذه الميزة تعطيل خلاصات RSS للمقالات أو التعليقات لتقليل السطح المعرض للسبام وتخفيف الوصول غير الضروري.

source: RSS feeds are links that allow users and programs to follow your site updates automatically. You may want to disable them if you do not use them to reduce server resource consumption by bots and discourage automated content scraping.
ar: خلاصات RSS هي روابط تتيح للمستخدمين والبرامج متابعة تحديثات موقعك تلقائياً. قد ترغب في تعطيلها إذا كنت لا تستخدمها لتقليل استهلاك موارد الخادم من قبل البوتات وتقليل محاولات سرقة المحتوى تلقائياً.

source: Enable the feature and choose what you want to disable (Posts, Comments, or All).
ar: فعل الميزة واختر الجزء الذي تريد تعطيله (المقالات، التعليقات، أو الكل).

source: Choose the response type that will appear when trying to access the disabled feed (410, 404, or Redirect to home).
ar: اختر نوع الرد الذي سيظهر عند محاولة الوصول للخلاصة (410، 404، أو تحويل للرئيسية).

source: It is recommended to enable the option to remove feed links from the page head to hide their existence completely.
ar: يفضّل تفعيل خيار حذف روابط الخلاصات من رأس الصفحة (Header) لإخفاء وجودها تماماً.

source: Warning: If you use services that rely on RSS such as automated newsletters, Jetpack, or feed reader apps, do not enable this feature.
ar: تنبيه: إذا كنت تستخدم خدمات تعتمد على RSS مثل القوائم البريدية التلقائية، Jetpack، أو تطبيقات قراءة الخلاصات، فلا تفعل هذه الميزة.

source: The 410 (Gone) option is recommended for search engines to tell them that this page has been permanently removed.
ar: خيار 410 (Gone) هو الموصى به لمحركات البحث لإخبارهم بأن هذه الصفحة قد حذفت نهائياً.

source: Disable Scope
ar: نطاق التعطيل

source: Choose which feeds you want to disable.
ar: اختر أي الخلاصات تريد تعطيلها.

source: Disable All (Recommended)
ar: تعطيل الكل (موصى به)

source: Disable Posts Feeds Only
ar: تعطيل خلاصات المقالات فقط

source: Disable Comments Feeds Only
ar: تعطيل خلاصات التعليقات فقط

source: Response Type
ar: نوع الرد

source: What happens when trying to access a disabled feed link.
ar: ماذا يحدث عند محاولة الوصول لرابط الخلاصة المعطلة.

source: 410 Gone (Recommended)
ar: 410 Gone (موصى به)

source: Redirect to Homepage
ar: تحويل إلى الصفحة الرئيسية

source: Remove Feed Links from Head (<head>)
ar: حذف روابط الخلاصات من الرأس (<head>)

source: Remove automatic feed links added by WordPress in the page code.
ar: إزالة روابط الخلاصات التلقائية التي يضيفها ووردبريس في كود الصفحة.

source: RSS feeds are disabled on this site.
ar: خلاصات RSS معطلة في هذا الموقع.

source: Feed Disabled
ar: الخلاصة معطلة

source: Admin Footer Text
ar: تخصيص نص تذييل لوحة التحكم

source: Customize the text displayed in the WordPress dashboard footer for branding or client sites.
ar: تتيح هذه الميزة تخصيص النص الظاهر في تذييل لوحة تحكم ووردبريس، وهو مفيد للعلامة التجارية أو مواقع العملاء.

source: The Admin Footer is the section at the bottom of every page in the WordPress dashboard. This feature allows you to replace the default texts with custom ones, which is very useful when delivering sites to clients or adding a special touch for your brand.
ar: تذييل صفحة لوحة التحكم (Admin Footer) هو الجزء الموجود أسفل كل صفحة في داشبورد ووردبريس. تتيح لك هذه الميزة استبدال النصوص الافتراضية بنصوص مخصصة، وهو أمر مفيد جداً عند تسليم المواقع للعملاء أو لإضافة لمسة خاصة بعلامتك التجارية.

source: Enable the feature to start customizing the texts.
ar: فعل الميزة للبدء في تخصيص النصوص.

source: Enter the desired text for the right side (usually the WordPress version) and the left side (the default thank you text).
ar: أدخل النص المطلوب للجهة اليمنى (عادة ما يكون إصدار ووردبريس) والجهة اليسرى (نص الشكر الافتراضي).

source: You can use simple HTML tags like <a> links or <strong> bold text.
ar: يمكنك استخدام أكواد HTML بسيطة مثل الروابط <a> أو الخط العريض <strong>.

source: Save the settings and you will see the change immediately at the bottom of the control panel.
ar: احفظ الإعدادات وستلاحظ التغيير فوراً في أسفل لوحة التحكم.

source: If you leave the fields empty, WordPress will continue to display its default texts.
ar: إذا تركت الحقول فارغة، سيستمر ووردبريس في عرض نصوصه الافتراضية.

source: The "Restore Default Text" option temporarily disables customization without deleting the texts you wrote.
ar: خيار "استعادة النص الافتراضي" يعطل التخصيص مؤقتاً دون حذف النصوص التي كتبتها.

source: This feature only appears in the control panel and does not affect the site from the outside.
ar: هذه الميزة تظهر فقط في لوحة التحكم ولا تؤثر على الموقع من الخارج.

source: Footer Text (Left)
ar: نص التذييل (يسار)

source: The text that replaces "Thank you for creating with WordPress". HTML allowed.
ar: النص الذي يحل محل "شكراً لاستخدامك ووردبريس". يسمح باستخدام HTML.

source: Footer Text (Right)
ar: نص التذييل (يمين)

source: The text that appears next to the version number. HTML allowed.
ar: النص الذي يظهر بجانب رقم الإصدار. يسمح باستخدام HTML.

source: Restore Default WordPress Text
ar: استعادة نص ووردبريس الافتراضي

source: Ignore custom texts and return to official WordPress texts.
ar: تجاهل النصوص المخصصة والعودة للنصوص الرسمية لووردبريس.

source: Admin Bar Greeting
ar: تغيير عبارة الترحيب في شريط الإدارة

source: Customize the "Howdy" greeting displayed next to your username in the admin bar.
ar: تتيح هذه الميزة تخصيص عبارة "Howdy" الظاهرة بجانب اسم المستخدم في شريط إدارة ووردبريس.

source: The "Howdy" greeting always appears next to the username in the top admin bar. This feature allows you to replace it with a custom greeting that fits your site's language or brand.
ar: عبارة الترحيب "Howdy" (أو "مرحباً") تظهر دائماً بجانب اسم المستخدم في شريط الإدارة العلوي. تتيح لك هذه الميزة استبدالها بعبارة مخصصة تناسب لغة موقعك أو علامتك التجارية.

source: Enable the feature to start customizing the greeting phrase.
ar: فعل الميزة للبدء في تخصيص عبارة الترحيب.

source: Enter the greeting phrase you prefer (e.g., "Welcome", "Hello", or "Good morning").
ar: أدخل عبارة الترحيب التي تفضلها (مثلاً: "أهلاً بك"، "مرحباً يا"، أو "السلام عليكم").

source: Choose whether you want to keep the username after the phrase or hide it.
ar: اختر ما إذا كنت تريد الإبقاء على اسم المستخدم بعد العبارة أم إخفاءه.

source: This change is cosmetic only and does not change any user permissions.
ar: هذا التغيير تجميلي فقط ولا يغير أي صلاحيات للمستخدم.

source: The change appears in the admin bar whether you are in the dashboard or browsing the site (provided the bar is visible).
ar: يظهر التغيير في شريط الإدارة سواء كنت في لوحة التحكم أو تتصفح الموقع من الخارج (بشرط ظهور الشريط).

source: Greeting Text
ar: نص الترحيب

source: The text that replaces "Howdy". Default is "مرحبًا".
ar: النص الذي يحل محل "Howdy". القيمة الافتراضية هي "مرحبًا".

source: Keep Username
ar: الإبقاء على اسم المستخدم

source: Display the username after the greeting text.
ar: إظهار اسم المستخدم بعد نص الترحيب.

source: Featured Image Column
ar: إضافة عمود الصورة البارزة

source: Adds a column to display the featured image in admin post and page lists.
ar: تضيف هذه الميزة عمودًا يعرض الصورة البارزة داخل قوائم المقالات والصفحات في لوحة التحكم.

source: This feature helps you review content visually and faster by displaying a thumbnail of the post directly in the "All Posts" or "All Pages" list.
ar: تساعدك هذه الميزة على مراجعة المحتوى بصرياً وبشكل أسرع من خلال عرض صورة مصغرة للمقال مباشرة في قائمة "كل المقالات" أو "كل الصفحات".

source: Enable the feature and choose the post types where you want the column to appear.
ar: فعل الميزة واختر أنواع المقالات التي تريد ظهور العمود فيها.

source: You can choose the image size (Thumbnail or Medium).
ar: يمكنك اختيار حجم الصورة (مصغرة أو متوسطة).

source: The new column will appear at the beginning of the list for easy viewing.
ar: سيظهر العمود الجديد في أول القائمة لتسهيل الرؤية.

source: This feature only appears in the control panel and does not affect the site speed for visitors.
ar: هذه الميزة تظهر فقط في لوحة التحكم ولا تؤثر على سرعة الموقع أمام الزوار.

source: If the post does not have a featured image, a default icon will appear (if enabled).
ar: إذا لم يكن للمقال صورة بارزة، سيظهر رمز افتراضي (إذا تم تفعيل الخيار).

source: Post Types
ar: أنواع المقالات

source: Choose the lists where you want to add the column.
ar: اختر القوائم التي تريد إضافة العمود إليها.

source: Posts
ar: المقالات (Posts)

source: Pages
ar: الصفحات (Pages)

source: Thumbnail Size
ar: حجم الصورة المصغرة

source: Choose the image size to be loaded in the column.
ar: اختر حجم الصورة التي سيتم تحميلها في العمود.

source: Thumbnail (Default)
ar: Thumbnail (افتراضي)

source: Medium
ar: Medium (متوسط)

source: Show Placeholder Icon
ar: إظهار رمز عند عدم وجود صورة

source: Display a default icon if no featured image is set.
ar: عرض أيقونة افتراضية إذا لم يتم تعيين صورة بارزة للمقال.

source: Image
ar: الصورة
