Repository: MajedBannani/ArBricks
Catalog: languages/arbricks-*.po
Languages: ar

source: 128px (Small)
ar: 128 بكسل (صغير)

source: 256px (Medium)
ar: 256 بكسل (متوسط)

source: 400px (Large)
ar: 400 بكسل (كبير)

source: 512px (Extra Large)
ar: 512 بكسل (كبير جداً)

source: API request timeout
ar: انتهاء مهلة طلب API

source: AR Copy to Clipboard
ar: نسخ إلى الحافظة (AR)

source: Add Google reCAPTCHA v2 checkbox to login form.
ar: إضافة مربع Google reCAPTCHA v2 إلى نموذج الدخول.

source: Add hidden honeypot field to block bots on login.
ar: إضافة حقل فخ مخفي لحظر البوتات.

source: Add the attribute <code>data-arbricks-copy="TEXT"</code> to any HTML element.
ar: أضف السمة <code>data-arbricks-copy="TEXT"</code> إلى أي عنصر HTML.

source: Add your domain and copy the Site Key and Secret Key
ar: أضف نطاقك وانسخ مفتاح الموقع (Site Key) والمفتاح السري (Secret Key)

source: Adds Google reCAPTCHA v2 ("I'm not a robot" checkbox) to the WordPress login page (wp-login.php) to prevent automated brute force attacks and bot login attempts.
ar: يضيف Google reCAPTCHA v2 (مربع "أنا لست روبوت") إلى صفحة تسجيل الدخول في ووردبريس (wp-login.php) لمنع هجمات التخمين الآلية ومحاولات دخول البوتات.

source: Adds a simple math captcha to wp-login.php and WooCommerce My Account login/register forms.
ar: يضيف اختبار تحقق رياضي بسيط لصفحة wp-login.php ولنموذجي تسجيل الدخول/التسجيل في صفحة حسابي الخاصة بووكومرس.

source: Adds a simple math question (e.g., "What is 3 + 5?") to login and registration forms to block automated bots. Works on WordPress core login (wp-login.php) and WooCommerce My Account login/register forms.
ar: يضيف سؤالاً رياضياً بسيطاً (مثل: "ما حاصل 3 + 5؟") لنماذج الدخول والتسجيل لحظر البوتات. يعمل على صفحة دخول ووردبريس الأساسية ونماذج التسجيل/الدخول في ووكومرس.

source: Adds an invisible "honeypot" field to the login form that bots fill out but humans don't see. Any login attempt with a filled honeypot is automatically blocked, preventing automated bot attacks without requiring user interaction.
ar: يضيف حقلاً مخفياً (فخ المصيدة) إلى نموذج تسجيل الدخول يملأه البوتات تلقائياً بينما لا يراه البشر. أي محاولة دخول بحقل فخ ممتلئ يتم حظرها تلقائياً، مما يمنع هجمات البوتات الآلية دون الحاجة لتفاعل المستخدم.

source: Admin bar will be hidden on frontend for non-admin users
ar: سيتم إخفاء شريط الإدارة في الواجهة الأمامية لغير المسؤولين.

source: All Admin Pages
ar: جميع صفحات الإدارة

source: All Admin Pages: Notice shows on every admin page for maximum visibility
ar: كل صفحات الإدارة: يظهر التنبيه في كل مكان لأقصى درجة من الانتباه.

source: Allow Dismissal
ar: السماح بالإغلاق

source: Allows you to copy any text to the clipboard by clicking on an HTML element. This is useful for sharing links, discount codes, or any specific text snippets.
ar: يتيح لك نسخ أي نص إلى الحافظة من خلال النقر على عنصر HTML. هذا مفيد لمشاركة الروابط أو أكواد الخصم أو أي نصوص محددة.

source: Always Overwrite
ar: استبدال دائماً

source: Always Overwrite: Replaces existing metadata every time - use with caution
ar: استبدال دائماً: يستبدل البيانات الموجودة في كل مرة - استخدمه بحذر.

source: Always removed: RSD link, Windows Live Writer manifest, shortlink
ar: يتم حذفها دائماً: رابط RSD، تقرير Windows Live Writer، الرابط المختصر.

source: Apply To
ar: تطبيق على

source: ArBricks
ar: بريكس بالعربي

source: ArBricks Settings
ar: إعدادات بريكس بالعربي

source: Arabic filename: صورة-منتج.jpg → Keeps original case if Preserve Case enabled
ar: اسم ملف عربي: صورة-منتج.jpg ← يحافظ على الصيغة الأصلية.

source: Arabic: "مجاني" or "بدون تكلفة"
ar: العربية: "مجاني" أو "بدون تكلفة"

source: Auto Image Meta on Upload
ar: بيانات الصورة التلقائية عند الرفع

source: Auto WebP Converter (Uploads)
ar: محول WebP التلقائي (الرفوعات)

source: Auto-generate alt text
ar: توليد النص البديل تلقائياً

source: Auto-generate attachment title
ar: توليد عنوان المرفق تلقائياً

source: Auto-generate caption (excerpt)
ar: توليد التسمية التوضيحية تلقائياً

source: Auto-generate description (content)
ar: توليد الوصف تلقائياً

source: Auto-update replaces manual update
ar: التحديث التلقائي يستبدل التحديث اليدوي

source: Automatically bypassed for XML-RPC, REST API, WP-CLI, and AJAX requests
ar: يتم التجاوز تلقائياً لطلبات XML-RPC و REST API و WP-CLI و AJAX.

source: Automatically convert uploaded JPEG/PNG images to WebP and replace the original file.
ar: تحويل صور JPEG/PNG المرفوعة تلقائياً إلى WebP واستبدال الملف الأصلي.

source: Automatically generate title, caption, description, and alt text from filename.
ar: إنشاء العنوان، والتسمية التوضيحية، والوصف، ونص alt تلقائيًا من اسم الملف.

source: Automatically generates image metadata (title, alt text, caption, description) from the filename when you upload images. Saves time and improves SEO by ensuring all images have proper alt text and titles.
ar: ينشئ بيانات الصورة تلقائياً (العنوان، النص البديل، التسمية والوصف) من اسم الملف عند الرفع. يوفر الوقت ويحسن SEO بضمان وجود نصوص بديلة وعناوين لجميع صورك.

source: Automatically optimizes your media library by converting new JPEG and PNG uploads to the modern WebP format. WebP images are significantly smaller in size without losing quality, leading to faster site loading times.
ar: يحسن مكتبة الوسائط تلقائياً عبر تحويل صور JPEG و PNG المرفوعة حديثاً إلى صيغة WebP الحديثة. صور WebP أصغر حجماً بكثير بدون فقدان الجودة، مما يؤدي لسرعة تحميل أكبر للموقع.

source: Automatically refreshes the cart totals whenever a customer changes the quantity of an item in their cart. Removes the need for customers to manually click the "Update Cart" button, providing a smoother and more modern shopping experience.
ar: يقوم بتحديث إجماليات السلة تلقائياً بمجرد تغيير العميل لكمية أي منتج. يغني العميل عن الضغط يدوياً على زر "تحديث السلة"، مما يوفر تجربة تسوق أكثر سلاسة وحداثة.

source: Automatically update cart when quantity changes.
ar: تحديث السلة تلقائياً عند تغيير الكمية.

source: Block Direct Access
ar: حظر الوصول المباشر

source: Block Direct Access: Returns 403 Forbidden when xmlrpc.php is accessed directly
ar: حظر الوصول المباشر: يعيد خطأ 403 (ممنوع) عند الوصول المباشر لملف xmlrpc.php.

source: Block Message
ar: رسالة الحظر

source: Body Open (Recommended)
ar: بداية Body (موصى به)

source: Bypass for Admins
ar: تجاوز للمسؤولين

source: Bypass for Admins: When enabled, users with administrator role skip reCAPTCHA verification
ar: تجاوز للمسؤولين: عند التفعيل، سيتخطى المستخدمون ذوو رتبة "مسؤول" التحقق من reCAPTCHA

source: CSS Hiding (recommended): Field is visually hidden but accessible to bots that ignore CSS
ar: الإخفاء بـ CSS (موصى به): الحقل مخفي بصرياً لكنه متاح للبوتات التي تتجاهل أكواد CSS.

source: CSS minified successfully!
ar: تم تصغير CSS بنجاح!

source: Cart Auto Update on Quantity Change
ar: تحديث السلة تلقائياً عند تغيير الكمية

source: Change Settings
ar: تغيير الإعدادات

source: Checks WordPress Settings → Reading → "Search engine visibility" option
ar: يتحقق من خيار "فهرسة الموقع" في إعدادات القراءة بووردبريس.

source: Choose "Apply To" mode: Only Empty Fields (safe) or Always Overwrite
ar: اختر الوضع: الحقول الفارغة فقط (آمن) أو استبدال دائماً.

source: Choose Compare Mode: Subtotal (before tax/shipping) or Total (after tax/shipping)
ar: اختر وضع المقارنة: المجموع الفرعي (قبل الضريبة والشحن) أو المجموع الكلي (بعد الضريبة والشحن).

source: Choose hiding method: CSS (recommended) or Hidden Input
ar: اختر طريقة الإخفاء: CSS (موصى به) أو مدخل مخفي (Hidden Input)

source: Choose the QR code size and error correction level.
ar: اختر حجم رمز QR ومستوى تصحيح الأخطاء.

source: Choose whether to include noscript tag for non-JS users.
ar: اختر تضمين وسم noscript للمستخدمين بدون JS.

source: Choose whether users can dismiss the notice
ar: اختر ما إذا كان يمكن للمستخدم إغلاق التنبيه.

source: Clean Separators
ar: تنظيف الفواصل

source: Clean Separators: Converts hyphens and underscores to spaces (my-image-file.jpg → My Image File)
ar: تنظيف الفواصل: يحول الشرطات والشرطات السفلية إلى مسافات.

source: Clear cart before adding new product
ar: مسح السلة قبل إضافة منتج جديد

source: Click "Generate" to create the QR code.
ar: انقر "إنشاء" لإنشاء رمز QR.

source: Click "Save Changes" to activate
ar: اضغط "حفظ التغييرات" للتفعيل

source: Click "Save Changes" to apply.
ar: اضغط «حفظ التغييرات» للتطبيق.

source: Code is automatically placed in correct locations (head + body/footer).
ar: يتم وضع الكود تلقائياً في المواضع الصحيحة.

source: Comma-separated billing field keys (e.g., billing_email,billing_first_name)
ar: معرفات حقول الفوترة (مثل: billing_email,billing_first_name).

source: Comments are disabled on this site.
ar: التعليقات معطلة على هذا الموقع.

source: Comments are immediately disabled sitewide
ar: سيتم تعطيل التعليقات فوراً على مستوى الموقع.

source: Compare Mode
ar: وضع المقارنة

source: Compatibility: Works with most themes using standard WooCommerce cart markup.
ar: التوافق: يعمل مع معظم القوالب التي تستخدم بنية سلة ووكومرس القياسية.

source: Completely disables all comment functionality across your entire WordPress site including frontend forms, admin interface, comment feeds, REST API, and admin bar. Perfect for sites that don't need comments (portfolios, business sites, blogs using external comment systems).
ar: يعطل جميع وظائف التعليقات تماماً في موقعك، بما في ذلك نماذج الواجهة الأمامية، لوحة التحكم، الخلاصات، واجهة REST API، وشريط الأدوات. مثالي للمواقع التي لا تحتاج لتعليقات (أعمال، شركات، مدونات تستخدم أنظمة خارجية).

source: Configure redirect behavior and message suppression settings.
ar: قم بتكوين سلوك إعادة التوجيه وإعدادات إخفاء الرسائل.

source: Configure text processing: Preserve Case and Clean Separators
ar: إعداد معالجة النص: الحفاظ على الأحرف وتنظيف الفواصل.

source: Configure where to show notice: All Admin Pages or Dashboard Only
ar: أختر مكان ظهور التنبيه: كل صفحات لوحة التحكم أو الرئيسية فقط.

source: Conversion complete!
ar: اكتمل التحويل!

source: Conversion failed.
ar: فشل التحويل.

source: Copied
ar: تم النسخ

source: Copied to clipboard!
ar: تم النسخ إلى الحافظة!

source: Copy
ar: نسخ

source: Copy Failed
ar: فشل النسخ

source: Copy Shortcode
ar: نسخ الكود المختصر

source: Copy text to clipboard when clicking any element with data-arbricks-copy
ar: نسخ النص إلى الحافظة عند النقر على أي عنصر يحتوي على data-arbricks-copy

source: Covers 3 forms: WordPress login, WooCommerce login, WooCommerce registration
ar: يغطي 3 نماذج: دخول ووردبريس، ودخول ووكومرس، وتسجيل ووكومرس.

source: Custom field name example: user_website_url (something bots might fill)
ar: مثال لاسم حقل مخصص: user_website_url (شيء قد تغرى البوتات بملئه).

source: Customize the error message (use %s as placeholder for the minimum amount)
ar: خصص رسالة الخطأ (استخدم %s كبديل لقيمة المبلغ الأدنى).

source: Customize the success and error messages in the settings below if needed.
ar: قم بتخصيص رسائل النجاح والخطأ في الإعدادات أدناه إذا لزم الأمر.

source: Dashboard Only
ar: لوحة التحكم فقط

source: Dashboard Only: Notice only shows on main dashboard
ar: الرئيسية فقط: يظهر التنبيه في صفحة لوحة التحكم الرئيسية فقط.

source: Debounce Delay (ms)
ar: تأخير منع التكرار (مللي ثانية)

source: Debounce Delay: Prevents multiple updates if a customer clicks the quantity buttons rapidly.
ar: تأخير منع التكرار: يمنع التحديثات المكررة إذا قام العميل بالضغط على أزرار الكمية بسرعة.

source: Decide whether to hide the manual "Update Cart" button.
ar: اختر ما إذا كنت تريد إخفاء زر "تحديث السلة" اليدوي.

source: Default Error Correction
ar: تصحيح الأخطاء الافتراضي

source: Default QR Code Size
ar: حجم رمز QR الافتراضي

source: Default Text (Fallback)
ar: النص الافتراضي (الاحتياطي)

source: Default error correction level.
ar: مستوى تصحيح الأخطاء الافتراضي.

source: Default field name: login_honeypot
ar: اسم الحقل الافتراضي: login_honeypot

source: Default size in pixels for generated QR codes.
ar: الحجم الافتراضي بالبكسل لرموز QR المُنشأة.

source: Developers can change required capability using "arbricks_admin_bar_capability" filter
ar: يمكن للمطورين تغيير الصلاحية المطلوبة عبر فلتر "arbricks_admin_bar_capability".

source: Direct Checkout (Single Item Flow)
ar: الدفع المباشر (تدفق عنصر واحد)

source: Disable Comments (Sitewide)
ar: تعطيل التعليقات (على مستوى الموقع)

source: Disable Order Again Button
ar: تعطيل زر الطلب مرة أخرى

source: Disable Order Again: Optionally removes the "Order Again" button from order history to maintain focus on current purchases.
ar: تعطيل "اطلب مجدداً": يزيل زر إعادة الطلب من سجل الطلبات للتركيز على الشراء الحالي.

source: Disable XML-RPC
ar: تعطيل XML-RPC

source: Disable XML-RPC completely and optionally block direct access.
ar: تعطيل XML-RPC بالكامل وحظر الوصول المباشر اختيارياً.

source: Disable comments everywhere (frontend + admin), remove UI entries, disable comment feeds, and remove REST comments endpoints.
ar: تعطيل التعليقات في كل مكان (الواجهة الأمامية + الإدارة)، إزالة مدخلات الواجهة، تعطيل خلاصات التعليقات، وإزالة نقاط نهاية REST.

source: Disabled
ar: غير مفعّل

source: Disables WordPress XML-RPC functionality which is often targeted by brute force attacks and DDoS attempts. XML-RPC is a legacy remote access protocol rarely needed on modern sites.
ar: يعطل وظيفة XML-RPC في ووردبريس التي غالباً ما تستهدف بهجمات التخمين وهجمات DDoS. بروتوكول XML-RPC هو تقنية قديمة للوصول عن بُعد ونادراً ما يُحتاج إليها اليوم.

source: Disables comment feeds (RSS/Atom) - returns 404 error
ar: يعطل خلاصات التعليقات (RSS/Atom) - ويعيد خطأ 404.

source: Dismissal: If allowed, users can hide notice (reappears on page reload unless dismissed per-user)
ar: الإغلاق: إذا سمحت بذلك، يمكن للمستخدم إخفاء التنبيه.

source: Display custom label for products with zero price.
ar: عرض تسمية مخصصة للمنتجات ذات السعر صفر.

source: Displays a prominent admin notice when "Discourage search engines from indexing this site" is enabled in WordPress settings. Prevents accidental launch of production sites with indexing blocked.
ar: يعرض تنبيهاً بارزاً في لوحة التحكم عند تفعيل خيار "منع محركات البحث من فهرسة الموقع" في إعدادات ووردبريس. يمنع الإطلاق العرضي للمواقع دون فهرستها.

source: Download PNG
ar: تنزيل PNG

source: Download the QR code as PNG image.
ar: تنزيل رمز QR كصورة PNG.

source: Easily add Google Tag Manager tracking to your WordPress site with automatic code injection.
ar: أضف تتبع مدير وسوم جوجل إلى موقعك في ووردبريس بسهولة مع حقن تلقائي للكود.

source: Easily create QR codes for URLs. Perfect for marketing materials, print materials, and sharing links.
ar: قم بإنشاء رموز QR للروابط بسهولة. مثالي للمواد التسويقية والمطبوعات ومشاركة الروابط.

source: Email Shortcode
ar: كود مختصر للبريد

source: Email address is encoded using WordPress antispambot() function
ar: يتم ترميز البريد الإلكتروني باستخدام دالة antispambot() الرسمية في ووردبريس.

source: Empty Cart Before Adding
ar: إفراغ السلة قبل الإضافة

source: Empty Cart Before Adding: Automatically clears the current cart before adding the new product. Prevents multi-item orders.
ar: إفراغ السلة قبل الإضافة: يمسح السلة الحالية تلقائياً قبل إضافة المنتج الجديد لمنع الطلبات المتعددة.

source: Enable CSS Hiding
ar: تفعيل الإخفاء بـ CSS

source: Enable or disable features as needed. Changes take effect immediately after saving.
ar: فعّل أو عطّل الميزات حسب الحاجة. تسري التغييرات فورًا بعد الحفظ.

source: Enable the feature toggle above
ar: فعّل مفتاح التبديل للميزة أعلاه

source: Enable the feature toggle above.
ar: فعّل المفتاح أعلاه.

source: Enabled
ar: مفعّل

source: Enforce minimum order amount at checkout.
ar: فرض قيمة طلب دنيا عند الدفع.

source: English: "Free!" or "No Charge"
ar: الإنجليزية: "Free!" أو "No Charge"

source: Ensure WooCommerce is installed and active
ar: تأكد من تثبيت وتفعيل إضافة ووكومرس.

source: Enter the URL you want to encode.
ar: أدخل الرابط الذي تريد ترميزه.

source: Enter your GTM Container ID (format: GTM-XXXXXXX).
ar: أدخل معرف الحاوية GTM (الصيغة: GTM-XXXXXXX).

source: Enter your GTM ID (e.g., GTM-XXXXXXX)
ar: أدخل معرف GTM (مثال: GTM-XXXXXXX)

source: Enter your custom "Free Text Label" (e.g., "Free!", "Gratis", "مجاني")
ar: أدخل نص "تسمية السعر المجاني" (مثال: "مجاني!"، "بدون تكلفة").

source: Error (Red)
ar: خطأ (أحمر)

source: Error Correction H = High (~30% recovery)
ar: تصحيح الأخطاء H = عالي (~30% استرداد)

source: Error Correction L = Low (~7% recovery)
ar: تصحيح الأخطاء L = منخفض (~7% استرداد)

source: Error Correction M = Medium (~15% recovery)
ar: تصحيح الأخطاء M = متوسط (~15% استرداد)

source: Error Correction Q = Quartile (~25% recovery)
ar: تصحيح الأخطاء Q = ربعي (~25% استرداد)

source: Error Message
ar: رسالة الخطأ

source: Error message appears both on cart page and during checkout
ar: تظهر رسالة الخطأ في صفحة السلة وعند إتمام الطلب على حد سواء.

source: Example question: "تحقق بسيط: كم حاصل 7 + 4 ؟" (Simple check: What is 7 + 4?)
ar: مثال للسؤال: "تحقق بسيط: كم حاصل 7 + 4 ؟"

source: Examples:
ar: أمثلة:

source: Existing comments remain in database but are completely hidden
ar: التعليقات القديمة ستبقى في قاعدة البيانات لكنها ستكون مخفية تماماً.

source: External Service: User IP addresses are sent to Google's servers for verification (required for reCAPTCHA to work)
ar: خدمة خارجية: يتم إرسال عناوين IP الخاصة بالمستخدمين إلى خوادم جوجل للتحقق (مطلوب لعمل الخدمة)

source: Failed to copy shortcode.
ar: فشل نسخ الكود المختصر.

source: Failed to copy.
ar: فشل النسخ.

source: Failed to generate QR code.
ar: فشل إنشاء رمز QR.

source: Failed to minify CSS.
ar: فشل تصغير CSS.

source: Field Name
ar: اسم الحقل

source: Field Name: Change only if you suspect bots have learned your field name (rare)
ar: اسم الحقل: قم بتغييره فقط إذا كنت تشك في أن البوتات تعرفت على الاسم (حالة نادرة).

source: Fields to Keep
ar: الحقول المحفوظة

source: Fields to Keep: Default is "billing_email,billing_first_name".
ar: حقول للمحافظة عليها: الافتراضي هو البريد والاسم الأول.

source: File extension is automatically removed (image.jpg → image)
ar: تتم إزالة امتداد الملف تلقائياً (image.jpg يصبح image).

source: Filename: product-red-shoes.jpg → Alt: "product red shoes" or "Product Red Shoes"
ar: اسم الملف: product-red-shoes.jpg ← النص البديل: "product red shoes"

source: Footer
ar: التذييل

source: Free Checkout Minimal Fields
ar: حقول الدفع المجاني الأقل

source: Free Price Label (Zero Price)
ar: تسمية السعر المجاني (سعر صفر)

source: Free Text Label
ar: تسمية النص المجاني

source: Free!
ar: مجاناً!

source: Future versions may add settings to remove REST API and RSS feed links
ar: قد تضيف الإصدارات المستقبلية إعدادات لحذف روابط REST API وخلاصات RSS.

source: GTM Container ID
ar: معرف حاوية GTM

source: Generate QR codes from URLs directly in admin interface.
ar: إنشاء رموز QR من الروابط مباشرة في واجهة الإدارة.

source: Get free API keys from Google reCAPTCHA: https://www.google.com/recaptcha/admin
ar: احصل على مفاتيح API مجانية من Google reCAPTCHA: https://www.google.com/recaptcha/admin

source: Go to your Cart page and change any product quantity to see it auto-update.
ar: اذهب لصفحة السلة وقم بتغيير كمية أي منتج لتشاهد التحديث التلقائي.

source: Google Tag Manager
ar: مدير وسوم جوجل

source: Google reCAPTCHA secret key (required)
ar: المفتاح السري لـ Google reCAPTCHA (مطلوب)

source: Google reCAPTCHA site key (required)
ar: مفتاح موقع Google reCAPTCHA (مطلوب)

source: Great for building email lists through free digital giveaways.
ar: رائع لبناء قوائم بريدية عبر توزيعات المنتجات الرقمية المجانية.

source: Head Cleanup
ar: تنظيف Head

source: Help
ar: مساعدة

source: Hidden Input: Uses type="hidden" which sophisticated bots may detect
ar: مدخل مخفي: يستخدم النوع "hidden" والذي قد تكتشفه البوتات المتطورة.

source: Hide "Product added to cart" notice
ar: إخفاء إشعار «تمت إضافة المنتج إلى السلة».

source: Hide Admin Bar (Non-Admins)
ar: إخفاء شريط الإدارة (لغير المسؤولين)

source: Hide Cart Update Notices
ar: إخفاء إشعارات تحديث السلة

source: Hide Update Button: Recommended for a cleaner UI when auto-update is active.
ar: إخفاء زر التحديث: موصى به لمظهر أنظف عند تفعيل التحديث التلقائي.

source: Hide Update Cart Button
ar: إخفاء زر تحديث السلة

source: Hide WordPress admin bar on the front-end for users who do not have a given capability.
ar: إخفاء شريط الإدارة في الواجهة الأمامية للمستخدمين الذين لا يملكون صلاحيات كافية.

source: Hide notices: Optionally suppresses the "Cart updated" message for a more seamless feel.
ar: إخفاء الإشعارات: يخفي رسالة "تم تحديث السلة" اختيارياً لتجربة أكثر انسيابية.

source: Hides the WordPress admin bar (the black bar at top of pages) on the frontend for users who are not administrators. Clean up your site's frontend appearance for subscribers, customers, and other non-admin users.
ar: يخفي شريط الإدارة (الشريط الأسود أعلى الصفحات) في الواجهة الأمامية للمستخدمين غير المسؤولين. قم بتنظيف مظهر موقعك للمشتركين والعملاء والمستخدمين الآخرين.

source: High (30%)
ar: عالي (30%)

source: Higher error correction allows QR codes to work even if partially damaged.
ar: تصحيح الأخطاء العالي يسمح لرموز QR بالعمل حتى لو تضررت جزئياً.

source: How to use:
ar: كيفية الاستخدام:

source: If WooCommerce is active, also test the My Account login and register forms
ar: إذا كان ووكومرس مفعلاً، اختبر أيضاً نموذج الدخول والتسجيل في صفحة "حسابي".

source: If product is on sale (regular price > 0, sale price = 0), shows strikethrough with free label
ar: إذا كان المنتج في عرض (السعر الأصلي > 0 وسعر العرض = 0)، ستظهر شطبة مع تسمية مجاني.

source: If search engines are currently blocked, you'll see the notice
ar: إذا كانت محركات البحث محظورة حالياً، فسترى هذا التنبيه.

source: If the browser does not support the Clipboard API, the error message will be shown.
ar: إذا كان المتصفح لا يدعم واجهة برمجة تطبيقات الحافظة، فسيتم عرض رسالة الخطأ.

source: Improves security by closing common attack vector
ar: يحسن الأمان عبر إغلاق ثغرة برمجية شائعة الاستهداف.

source: In "Fields to Keep", enter a comma-separated list of field IDs you want to remain visible.
ar: في "حقول للمحافظة عليها"، أدخل قائمة بأسماء الحقول (مفصولة بفاصلة) التي تريد بقاءها ظاهرة.

source: In any post, page, or widget, use: [email]youraddress@example.com[/email]
ar: في أي مقال أو صفحة أو ودجت، استخدم: [email]address@example.com[/email]

source: Include noscript tag
ar: تضمين وسم noscript

source: Inject Google Tag Manager scripts into your site.
ar: إدراج سكريبتات مدير وسوم جوجل في موقعك.

source: Inject noscript fallback for users without JavaScript.
ar: إدراج بديل noscript للمستخدمين بدون جافاسكربت.

source: Inspect page source - you should not see generator meta tag
ar: افحص مصدر الصفحة - لا يجب أن تظهر وسوم generator.

source: Inspect page source to verify cleaner <head> section
ar: يمكنك فحص "مصدر الصفحة" للتأكد من نظافة قسم <head>.

source: Invalid GTM IDs will be rejected - nothing will be injected.
ar: سيتم رفض معرفات GTM غير الصحيحة.

source: Invalid ID: GA-123456 (this is Analytics, not Tag Manager)
ar: معرّف خاطئ: GA-123456 (هذا Analytics وليس Tag Manager)

source: Invalid email addresses are displayed as plain text (not linked)
ar: عناوين البريد غير الصحيحة ستظهر كنص عادي بدون رابط.

source: Jetpack and some plugins may require XML-RPC - test after enabling
ar: قد يحتاج Jetpack وبعض الإضافات الأخرى إلى XML-RPC - يرجى الاختبار بعد التفعيل.

source: Keep original case (recommended for non-Latin text)
ar: الحفاظ على الأحرف الأصلية (موصى به للنص غير اللاتيني)

source: Larger sizes are better for print materials.
ar: الأحجام الأكبر أفضل للمواد المطبوعة.

source: Leave this field empty
ar: اترك هذا الحقل فارغاً

source: Let users dismiss the notice
ar: السماح للمستخدمين بإغلاق الإشعار

source: Logged-out users are not affected (they never see admin bar anyway)
ar: لا يتأثر الزوار غير المسجلين (فهم لا يرون الشريط أصلاً).

source: Login Honeypot
ar: فخ تسجيل الدخول

source: Login attempt blocked.
ar: تم حظر محاولة الدخول.

source: Login reCAPTCHA (v2)
ar: reCAPTCHA لتسجيل الدخول (v2)

source: Low (7%)
ar: منخفض (7%)

source: Math Captcha (Login + Woo My Account)
ar: كابتشا رياضية (الدخول + حسابي ووكومرس)
